Revit 2027 API
TriangulatedSolidOrShell Properties
The TriangulatedSolidOrShell type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
ShellComponentCount |  The number of TriangulatedShellComponents that this TriangulatedSolidOrShell contains.
Top
See Also
Reference
TriangulatedSolidOrShell Class
Autodesk.Revit.DB Namespace